## Staging: app
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
lambda.tf
```
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 2 to change, 3 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.archiver will be updated in-place
  ~ resource "aws_lambda_function" "archiver" {
        id                             = "Archiver"
      ~ last_modified                  = "2023-03-22T12:32:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:5",
        ] -> (known after apply)
      ~ source_code_hash               = "Wxuy1cFnP4tH2A4LDQIaEsLXMJbQgVrwTRE9hVOYQhU=" -> "WLcEwUovGXcTUmC7CrpB68mJ21Ii8DK+ICFTpl6f4EA="
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_lib_packages:1",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_node_packages:1",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.archiver_lib must be replaced
-/+ resource "aws_lambda_layer_version" "archiver_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:5" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-03-21T14:58:29.297+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages:5" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:archiver_node_packages" -> (known after apply)
      ~ layer_name                  = "archiver_node_packages" -> "archiver_lib_packages" # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_size            = 830 -> (known after apply)
      ~ version                     = "5" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.archiver_nodejs will be created
  + resource "aws_lambda_layer_version" "archiver_nodejs" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/archiver_nodejs.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "archiver_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "jYlBIq7LND2fKMV8g/kdjhSh/eZM5MlW40XLZzEHl9I="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.nagware_lib must be replaced
-/+ resource "aws_lambda_layer_version" "nagware_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_lib_packages:1" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-03-21T19:02:01.998+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_lib_packages:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "kOwjJJ72y/RuK7OJMYnERAP/EzgkHwlKJpfxgEsGFL4=" -> "DQ2lnduZx/UEP3ZzLZkERnI4oHLZLB9czq/LMztPLok=" # forces replacement
      ~ source_code_size            = 4085 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.nagware_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "nagware_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_node_packages:1" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-03-21T19:02:08.125+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_node_packages:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:nagware_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "l9qE/T9mxFPDX5ZOvP6B3UUPDcB4yFkjXI1riUWlOTw=" -> "mhMraG0YW1VLeg7ufCX+Kh3odjS/GYpXYbtkKidzBA0=" # forces replacement
      ~ source_code_size            = 4322374 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 3 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_cloudwatch_metric_alarm.scan_files_api_error[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.vault_scan_object.aws_iam_role.s3_scan_object"]

24 tests, 17 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
